Tekla Open API Reference for Tekla Structures 2025
GridSurface Constructor
Overload List
Name | Description
GridSurface()
 Creates a new grid surface instance.
The default values are as follows:
Label = "Default";
IsMagnetic = false;
ExtensionLeft = 2000.0;
ExtensionRight = 2000.0;
ExtensionBelow = 2000.0;
ExtensionAbove = 2000.0;
DrawingVisibility = false;
GridSurface(String)
 Creates a new grid surface instance taking the label as input.
Top
See Also
Reference
GridSurface Class
Tekla.Structures.Model Namespace